/*
 * @Descripttion:
 * @version:
 * @Author: Yanzengyong
 * @Date: 2020-08-17 09:06:45
 * @LastEditors: Zhangyao
 * @LastEditTime: 2020-09-01 12:08:20
 */
const reg = {
	regNoChinese: '^[^\u4E00-\u9FA5]+$', //不能为中文
	onlyNum: '^(?:[0-9]{1,3}|1000)$', //只能输入0~1000的数字
	num: '^(-|+?)\\d+(\\.\\d+)?$', //只能包含正负数
	port:
		'^([0-9]|[1-9]\\d{1,3}|[1-5]\\d{4}|6[0-4]\\d{4}|65[0-4]\\d{2}|655[0-2]\\d|6553[0-5])+$', // 端口号的验证
	address:
		'^((1\\d{2}|25[0-5]|2[0-4]d|[1-9]?\\d)\\.){3}(25[0-5]|2[0-4]\\d|1\\d{2}|[1-9]?\\d)$', // 数据库地址的验证
	name: '^[A-Za-z0-9-_]+$', //只允许数字英文下划线
	NCE: '^[A-z0-9\u4e00-\u9fa5]*$', //只允许中文英文数字
	email: '^([A-Za-z0-9_+-.])+@([A-Za-z0-9-.])+.([A-Za-z]{2,22})$', // 合法邮箱
	onlyCode: '[,.+_-`;=?:><|/!@#$%^&*]',
	noSpace: '[^/^\\s+/g]+$', //不能输入空格
	url: '^http://([\\w-]+\\.)+[\\w-]+(/[\\w-./?%&=]*)?$', // URL格式
}
export default reg
